Repository: illkil/2025_GP_4
Catalog: wujed/lib/l10n/app_*.arb
Languages: ar

# intro1_title_part1
source: Welcome to
ar: مرحبًا بك في

# intro1_title_part2
source: Wujed
ar: وُجِد

# intro1_description
source: Every lost item has a way back home. With Wujed, you can find what’s missing or help return what’s found.
ar: كل غرض مفقود له طريق للعودة. مع وجد، يمكنك العثور على ما فقدته أو المساعدة في إعادة ما تم العثور عليه.

# intro2_title_part1
source: We’ll help you
ar: سوف نساعدك

# intro2_title_part2
source: find it
ar: في العثور عليه

# intro2_description
source: Simply report what’s lost or found, and Wujed’s AI works to bring people and their belongings back together.
ar: ببساطة أبلغ عما فُقد أو وُجد، ويعمل ذكاء وجد الاصطناعي على جمع الناس بمقتنياتهم من جديد.

# intro3_title_part1
source: Your part
ar: مساهمتك

# intro3_title_part2
source: matters
ar: مهمة

# intro3_description
source: Your reports help someone find what they’ve lost and together, we make a difference.
ar: تقاريرك تساعد الآخرين في إيجاد ما فقدوه ومعًا نصنع الفرق.

# login_title
source: Welcome Back!
ar: أهلاً بعودتك!

# login_subtitle
source: Please Log in to continue
ar: يرجى تسجيل الدخول للمتابعة

# login_email_label
source: Email
ar: البريد الإلكتروني

# login_password_label
source: Password
ar: كلمة المرور

# login_forgot_password
source: Forgot Password?
ar: نسيت كلمة المرور؟

# login_button
source: Log In
ar: تسجيل الدخول

# login_no_account
source: Don't have an account?
ar: ليس لديك حساب؟

# login_signup_link
source: Sign Up
ar: إنشاء حساب

# common_or
source: OR
ar: أو

# google_continue
source: Continue with Google
ar: المتابعة باستخدام Google

# login_error_fill_all
source: Please fill all the details
ar: يرجى تعبئة جميع البيانات

# login_error_invalid
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# login_error_too_many_attepmts
source: Too many log in attempts Please try again in 3 minutes
ar: عدد كبير من محاولات تسجيل الدخول يرجى المحاولة مرة أخرى خلال 3 دقائق

# login_error_failed
source: Login failed, Please try again
ar: فشل تسجيل الدخول، يرجى المحاولة مرة أخرى

# login_locked
source: Please wait {remaining} seconds before trying again
ar: الرجاء الإنتظار {remaining} ثانية قبل المحاولة مرة أخرى

# login_email_not_verified
source: Email is not verified
ar: البريد الإلكتروني غير مؤكد

# login_email_verification_message
source: We've sent a verification link to your email. Please check your inbox and click the link to verify your email before logging in. If you don't see it in your inbox, check your Spam or Junk folder. If you didn't receive it or it expired, press Resend. If you got it, press Continue.
ar: لقد أرسلنا رابط التحقق إلى بريدك الإلكتروني. يرجى التحقق من صندوق الوارد والضغط على الرابط لتأكيد بريدك الإلكتروني قبل تسجيل الدخول. إذا لم تجد الرسالة في صندوق الوارد، تحقق من مجلد الرسائل غير المرغوب فيها أو المهملات. إذا لم تصلك الرسالة أو انتهت صلاحيتها، اضغط إعادة الإرسال. إذا وصلتك، اضغط متابعة.

# login_btn_resend
source: Resend
ar: إعادة الإرسال

# signup_title
source: Join Us!
ar: انضم إلينا!

# signup_subtitle
source: Fill all the details to create your account
ar: املأ جميع البيانات لإنشاء حسابك

# signup_username_label
source: Username
ar: اسم المستخدم

# signup_email_label
source: Email
ar: البريد الإلكتروني

# signup_password_label
source: Password
ar: كلمة المرور

# signup_username_taken
source: This username is taken
ar: اسم المستخدم مستخدم بالفعل

# signup_email_exists
source: This email already exists
ar: البريد الإلكتروني مسجّل بالفعل

# signup_invalid_email_format
source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

# signup_failed
source: Failed creating an account
ar: فشل إنشاء الحساب

# signup_password_weak
source: Use 8 or more characters with a mix of uppercase and lowercase letters and numbers
ar: استخدم 8 أحرف أو أكثر مع مزيج من حروف كبيرة وصغيرة وأرقام

# signup_age_checkbox
source: I am 18 years old or older
ar: عمري 18 سنة أو أكثر

# signup_button
source: Sign Up
ar: إنشاء حساب

# signup_have_account
source: Already have an account?
ar: لديك حساب بالفعل؟

# signup_login_link
source: Log In
ar: تسجيل الدخول

# google_signup
source: Sign up with Google
ar: التسجيل باستخدام Google

# check_18yo_checkbox
source: Please confirm that you are 18 years old or older
ar: يرجى تأكيد أنك تبلغ من العمر 18 عامًا أو أكثر

# signup_account_created_success
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# signup_email_verification_message
source: We've sent a verification link to your email. Please check your inbox and click the link to verify your email before logging in. If you don't see it in your inbox, please check your Spam or Junk folder.
ar: لقد أرسلنا رابط التحقق إلى بريدك الإلكتروني. يرجى التحقق من صندوق الوارد والضغط على الرابط لتأكيد بريدك الإلكتروني قبل تسجيل الدخول. إذا لم تكن الرسالة موجودة في صندوق الوارد، يرجى التحقق من مجلد الرسائل غير المرغوب فيها أو المهملات.

# signup_username_rules
source: Username must contain at least one letter, it can only include letters, numbers, dots (.), underscores (_), and no spaces allowed.
ar: يجب أن يحتوي اسم المستخدم على حرف واحد على الأقل. ويمكن أن يتضمن فقط الأحرف، الأرقام، النقاط (.)، والشرطة السفلية (_)، بدون مسافات.

# signup_username_min_length
source: Username must be at least 3 characters or more
ar: يجب أن يكون اسم المستخدم 3 أحرف على الأقل أو أكثر

# signup_all_details_valid
source: All details must be valid
ar: يجب أن تكون جميع التفاصيل صالحة

# forgot_title
source: Forgot Password
ar: استعادة كلمة المرور

# forgot_subtitle
source: Enter your email account to reset your password
ar: أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور

# forgot_email_label
source: Email
ar: البريد الإلكتروني

# forgot_reset_button
source: Reset Password
ar: إعادة تعيين كلمة المرور

# forgot_email_empty
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# forgot_send_otp_code
source: Send OTP Code
ar: إرسال رمز التحقق

# forgot_failed_otp
source: Failed to send OTP, Try again later
ar: فشل في إرسال رمز التحقق، حاول مرة أخرى لاحقًا

# forgot_network_error
source: Network error, please check your internet connection
ar: خطأ في الشبكة، يرجى التحقق من اتصال الإنترنت

# verify_title
source: OTP Verification
ar: التحقق برمز التأكيد

# verify_subtitle
source: Please check your email for the verification code
ar: يرجى تفقد بريدك الإلكتروني للحصول على رمز التحقق

# verify_button
source: Verify
ar: تأكيد

# verify_resend
source: Resend code
ar: إعادة إرسال الرمز

# verify_reset_password_email
source: Reset Password Email
ar: بريد إعادة تعيين كلمة المرور

# verify_reset_password_info
source: We've sent you an email to reset your password. If you don't see it in your inbox, check your Spam or Junk folder.
ar: لقد أرسلنا لك بريدًا لإعادة تعيين كلمة المرور، إذا لم تجده في بريدك الوارد، فتحقق من مجلد الرسائل غير المرغوب فيها أو المهملات.

# verify_invalid_code
source: Invalid or expired code, please try again
ar: رمز غير صالح أو منتهي الصلاحية، يرجى المحاولة مرة أخرى

# verify_new_otp_sent
source: New OTP sent successfully
ar: تم إرسال رمز التحقق الجديد بنجاح

# verify_failed_resend_otp
source: Failed to resend OTP, try again later
ar: فشل في إعادة إرسال رمز التحقق، حاول مرة أخرى لاحقًا

# verify_wait_timer
source: Please wait for the timer to finish to get a new OTP code
ar: يرجى الانتظار حتى ينتهي المؤقت للحصول على رمز تحقق جديد

# reset_password_changed_title
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# reset_password_changed_message
source: Please log in with your new password to access the app
ar: يرجى تسجيل الدخول باستخدام كلمة المرور الجديدة للوصول إلى التطبيق

# reset_password_failed
source: Failed to change password
ar: فشل في تغيير كلمة المرور

# reset_password_error
source: Error resetting password
ar: حدث خطأ أثناء إعادة تعيين كلمة المرور

# reset_title
source: Reset Password
ar: إعادة تعيين كلمة المرور

# reset_subtitle
source: Enter and confirm your new password
ar: أدخل كلمة المرور الجديدة وأكدها

# reset_new_password_label
source: New Password
ar: كلمة المرور الجديدة

# reset_confirm_password_label
source: Confirm Password
ar: تأكيد كلمة المرور

# reset_button
source: Reset Password
ar: إعادة تعيين كلمة المرور

# reset_password_match
source: Passwords must match
ar: يجب أن تتطابق كلمتا المرور

# home_what_item_question
source: What item are you reporting?
ar: ما العنصر الذي تريد الإبلاغ عنه؟

# home_lost_button
source: Lost
ar: مفقود

# home_found_button
source: Found
ar: معثور عليه

# home_stats_brand
source: Wujed
ar: وُجِد

# home_stats_suffix
source: in numbers
ar: بالأرقام

# home_stat_reports_title
source: Reports Submitted
ar: التقارير المقدمة

# home_stat_items_title
source: Items Recovered
ar: العناصر المستعادة

# home_stat_matches_title
source: Matches Found
ar: التطابقات الموجودة

# home_card_title
source: Coffee Brewer
ar: آلة تحضير القهوة

# home_card_subtitle
source: Check back with your previous report
ar: راجع تقريرك السابق

# home_card_view_arrow_aria
source: View report details
ar: عرض تفاصيل التقرير

# home_note
source: Stay safe, meet in public areas, and avoid sharing personal details.
ar: ابقَ آمنًا، قابل الآخرين في الأماكن العامة، وتجنّب مشاركة معلوماتك الشخصية.

# navbar_home
source: Home
ar: الرئيسية

# navbar_history
source: History
ar: السجل

# navbar_messages
source: Messages
ar: الرسائل

# navbar_profile
source: Profile
ar: الملف الشخصي

# notifications_title
source: Notifications
ar: الإشعارات

# notifications_expired_title
source: Report Expired
ar: انتهت صلاحية التقرير

# notifications_expired_body
source: your report of Item5 has expired due to unconfirmed receipt.
ar: انتهت صلاحية تقريرك عن Item5 بسبب عدم تأكيد الاستلام.

# notifications_new_match_title
source: New Match Found
ar: تم العثور على تطابق جديد

# notifications_new_match_body
source: A new match has been found for your report of Coffee Brewer.
ar: تم العثور على تطابق جديد لتقريرك عن آلة تحضير القهوة.

# notifications_expiring_soon_title
source: Report Expiring Soon
ar: تقرير سينتهي قريبًا

# notifications_expiring_soon_body
source: Your report of Coffee Brewer will expire in 5 days unless you renew it or accept a match.
ar: سينتهي تقريرك عن آلة تحضير القهوة خلال 5 أيام ما لم تقم بتجديده أو قبول تطابق.

# notifications_time_2d
source: 2 days ago
ar: قبل يومين

# notifications_time_6d
source: 6 days ago
ar: قبل 6 أيام

# notifications_time_9d
source: 9 days ago
ar: قبل 9 أيام

# report_found_title
source: Report A Found Item
ar: الإبلاغ عن عنصر معثور عليه

# report_lost_title
source: Report A Lost Item
ar: الإبلاغ عن عنصر مفقود

# report_required_details
source: Please fill all required details
ar: يرجى تعبئة جميع الحقول المطلوبة

# report_title_label
source: Title
ar: العنوان

# report_title_hint
source: Example: Brown wallet
ar: مثال: محفظة بنية

# report_photo_label
source: Photo
ar: الصورة

# report_location_label
source: Location
ar: الموقع

# report_location_button_hint
source: Click here to add a Location
ar: انقر هنا لإضافة موقع

# report_description_label
source: Description
ar: الوصف

# report_description_hint
source: Describe your item (Type, Color, Brand, etc)
ar: صف عنصرَك (النوع، اللون، العلامة التجارية، إلخ)

# report_counter_left
source: {remaining} characters left
ar: عدد الأحرف المتبقية: {remaining}

# report_submit_button
source: Submit
ar: إرسال

# report_upload_photos_hint
source: Click here to add up to 2 Photos
ar: انقر هنا لإضافة ما يصل إلى صورتين

# sheet_choose_location_title
source: Choose a Location
ar: اختر موقعًا

# sheet_current_location_title
source: Your current location
ar: موقعك الحالي

# sheet_current_location_sub
source: King Saud University, Riyadh 12372
ar: جامعة الملك سعود، الرياض 12372

# sheet_choose_manually
source: Choose Manually
ar: اختر يدويًا

# sheet_confirm
source: Confirm
ar: تأكيد

# sheet_send
source: Send
ar: إرسال

# history_title
source: History
ar: السجل

# history_tab_lost
source: Lost
ar: مفقود

# history_tab_found
source: Found
ar: معثور عليه

# item_title_coffee_brewer
source: Coffee Brewer
ar: آلة تحضير القهوة

# item_title_coffee_mug
source: Coffee Mug
ar: كوب قهوة

# details_location_label
source: Location
ar: الموقع

# details_description_label
source: Description
ar: الوصف

# lost_found_matches_title
source: Found Matches
ar: التطابقات الموجودة

# match_confidence
source: {percent}% Your Item
ar: {percent}% عنصرُك

# dialog_are_you_sure_item
source: Are you sure this is your item?
ar: هل أنت متأكد أن هذا هو عنصرُك؟

# dialog_accept_match_note
source: Accepting this match will hide the others. If it's not your item, just tap 'Revoke' to bring them back.
ar: قبول هذا التطابق سيخفي الباقي. إذا لم يكن عنصرَك، اضغط "سحب" لإعادتها.

# dialog_are_you_sure
source: Are you sure?
ar: هل أنت متأكد؟

# dialog_remove_permanently_note
source: This match will be removed permanently. Continue only if you're sure it's not your item.
ar: سيُحذف هذا التطابق نهائيًا. تابع فقط إذا كنت متأكدًا أنه ليس عنصرَك.

# dialog_confirm_received_note
source: Continue only if you’re certain that you’ve received your item.
ar: تابع فقط إذا كنت متأكدًا أنك استلمت غرضك.

# report_cancel_dialog_info
source: Deleting this report means it will be removed and no longer processed.
ar: سيتم حذف هذا البلاغ ولن يتم معالجته بعد الآن.

# btn_accept
source: Accept
ar: قبول

# btn_reject
source: Reject
ar: رفض

# btn_revoke
source: Revoke
ar: سحب

# btn_confirm
source: Confirm
ar: تأكيد

# btn_cancel
source: Cancel
ar: إلغاء

# btn_delete
source: Delete
ar: حذف

# btn_confirm_receipt
source: Confirm Receipt
ar: تأكيد الاستلام

# btn_continue
source: Continue
ar: متابعة

# btn_renew
source: Renew
ar: تجديد

# toast_congrats
source: Congratulations!
ar: تهانينا!

# toast_got_item_back
source: You got your item back! Enjoy having it safe and sound again
ar: لقد استعدت عنصرَك! استمتع بعودته بأمان

# submit_success_title
source: All done! your report has been submitted successfully
ar: تم! تم إرسال تقريرك بنجاح

# appTitle
source: Wujed
ar: وُجد

# messages_title
source: Messages
ar: الرسائل

# messages_you_prefix
source: You:
ar: أنت:

# messages_typing
source: Typing...
ar: يكتب...

# messages_items_matched
source: Your Items Matched!
ar: تم تطابق عناصرِك!

# action_block
source: Block
ar: حظر

# chat_hello_found_item
source: Hello, I think I found your item
ar: مرحبًا، أعتقد أنني وجدت عنصرَك

# chat_great_do
source: Great! Let's do
ar: رائع! لنفعل ذلك

# chat_lets_decide
source: Let's decide on a place and time to meet!
ar: دعنا نقرر مكانًا ووقتًا للقاء!

# chat_yes_match
source: Yes in fact it does match
ar: نعم في الواقع إنه يطابق

# chat_id_request
source: That sounds like mine. Inside there should be a student ID with the name Ghaida Mo. Can you check if it matches?
ar: يبدو أنه يخصني. بالداخل يجب أن تكون هناك بطاقة طالب باسم Ghaida Mo. هل يمكنك التحقق إذا كانت متطابقة؟

# chat_hello
source: Hello!
ar: مرحبًا!

# chat_date
source: Today
ar: اليوم

# chat_hint
source: Type Your Message...
ar: اكتب رسالتك...

# profile_title
source: Profile
ar: الملف الشخصي

# menu_switch_language
source: Switch Language
ar: تبديل اللغة

# action_log_out
source: Log Out
ar: تسجيل الخروج

source: Blocked Users
ar: المستخدمون المحظورون

# unblock_user
source: Unblock
ar: إلغاء الحظر

# unblock_dialog_title
source: Unblock User
ar: إلغاء الحظر

# unblock_user_confirm
source: Are you sure you want to unblock {name}?
ar: هل أنت متأكد أنك تريد إلغاء حظر {name}؟

# label_first_name
source: First Name
ar: الاسم الأول

# label_last_name
source: Last Name
ar: اسم العائلة

# label_phone_number
source: Phone Number
ar: رقم الجوال

# placeholder_not_provided
source: Not provided
ar: غير متوفر

source: No new data entered
ar: لا توجد بيانات جديدة

# profile_update_success
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

# profile_update_failed
source: Failed updating profile
ar: فشل تحديث الملف الشخصي

# first_name_too_short
source: First name must be at least 2 characters
ar: يجب أن يكون الاسم الأول حرفين فأكثر

# last_name_too_short
source: Last name must be at least 2 characters
ar: يجب أن يكون اسم العائلة حرفين فأكثر

# phone_invalid_length
source: Phone number must be exactly 9 numbers
ar: يجب أن يتكون رقم الجوال من 9 أرقام

# edit_profile_title
source: Edit Profile
ar: تعديل الملف الشخصي

# edit_profile_change_picture
source: Change Profile Picture
ar: تغيير صورة الملف الشخصي

# action_done
source: Done
ar: تم

# onboarding_skip
source: Skip
ar: تخطي

# onboarding_next
source: Next
ar: التالي

# onboarding_done
source: Done
ar: تم

# btn_send
source: Send
ar: إرسال

# btn_ok
source: Ok
ar: حسنًا

# common_error_generic
source: Oops, something went wrong
ar: عذرًا، حدث خطأ ما

# common_empty
source: No information yet
ar: لا توجد معلومات بعد

# common_untitled
source: Untitled
ar: بدون عنوان

# label_value_missing
source: Not provided
ar: غير متوفر

# history_no_found_reports
source: No found reports yet
ar: لا توجد بلاغات عثور حتى الآن

# history_no_lost_reports
source: No lost reports yet
ar: لا توجد بلاغات فقدان حتى الآن

# status_ongoing
source: Ongoing
ar: قيد المعالجة

# status_done
source: Done
ar: مكتمل

# status_rejected
source: Rejected
ar: مرفوض

# status_match_found
source: Match found
ar: تم العثور على تطابق

# status_expired
source: Expired
ar: منتهي

# pick_location_enable_service_title
source: Location Service
ar: خدمة الموقع

# pick_location_enable_service_body
source: Please enable location services.
ar: يرجى تفعيل خدمات الموقع.

# pick_location_permission_title
source: Location Permission
ar: إذن الموقع

# pick_location_permission_body
source: Please enable location permission.
ar: يرجى السماح بإذن الموقع.

# pick_location_permission_settings_body
source: Please enable location permission from settings.
ar: يرجى تفعيل إذن الموقع من الإعدادات.

# pick_location_error_title
source: Location Error
ar: خطأ في الموقع

# pick_location_error_body
source: Could not get current location. Please try again or choose your location manually.
ar: تعذّر الحصول على الموقع الحالي. يرجى المحاولة مرة أخرى أو اختيار موقعك يدويًا.

# pick_location_tap_hint
source: Tap the map to choose a spot
ar: اضغط على الخريطة لاختيار موقع

# title_indicator
source: characters left
ar: أحرف متبقية

# snackbar_fill_fields
source: Please fill title and description
ar: يرجى تعبئة العنوان والوصف

# snackbar_pick_location
source: Please pick a location
ar: يرجى تحديد الموقع

# snackbar_add_photos
source: Please add at least 1 photo
ar: يرجى إضافة صورة واحدة على الأقل

# snackbar_submit_failed
source: Submit failed: {error}
ar: فشل الإرسال: {error}

# snackbar_location_set
source: Location set successfully
ar: تم تحديد الموقع بنجاح

# snackbar_location_not_selected
source: Location not selected
ar: لم يتم تحديد الموقع

# report_submitting
source: Submitting…
ar: جاري الإرسال…

source: Outside Riyadh
ar: خارج الرياض

# outside_dialog
source: Your location is outside Riyadh boundaries.
ar: موقعك خارج حدود الرياض.
